const SEP = '[\\\\/.]';
const EXTSEP = '[\\\\./—־-]';
const HEB = '[א-ת\'׳״"]';
const FIN = '[ןףךםץ]';
const B = '(?=^|$|\b|[^א-ת\'׳״"?\u0590-\u05BD\u05BF\u05C1-\u05C2\u05C4-\u05C7\u05EF-\u05F2\uFB2A-\uFB4F])'; // Boundary, like "\b" in regex. All unicode characters which can be part of a hebrew word

export default [
  // Whole Words
  [`א${EXTSEP}נשים`, 'אנשים', 'נשים'], // א.נשים
  [`א${EXTSEP}נשי(?!ם)`, 'אנשי', 'נשות'], // א.נשי
  [`את${SEP}ה`, 'אתה', 'את'], // את/ה
  [`איש${SEP}אשת`, 'איש', 'אשת'], // איש/אשת
  [`אשת${SEP}איש`, 'איש', 'אשת'], // אשת/איש
  [`רו(ץ|צ)${SEP}י${B}`, 'רוץ', 'רוצי'], // רוצ/י
  [`קו(ם|מ)${SEP}י${B}`, 'קום', 'קומי'], // קומ/י
  [`עו(ף|פ)${SEP}י${B}`, 'עוף', 'עופי'], // עופ/י
  [`שי(ם|מ)${SEP}י${B}`, 'שים', 'שימי'], // שימ/י
  [`שלח${SEP}י${B}`, 'שלח', 'שלחי'], // שלח/י
  [`אח${SEP}ות${B}`, 'אח', 'אחות'], // אח/ות
  [`ל(ו|ה)${SEP}ל(ו|ה)${B}`, 'לו', 'לה'], // לו/לה, לה/לו
  [`ב(ן|ת)${SEP}ב(ן|ת)${B}`, 'בן', 'בת'], // בת/בן, בן/בת
  [`ה(ו|י)א${SEP}ה(ו|י)א${B}`, 'הוא', 'היא'], // הוא/היא, היא/הוא
  [`אנשי${SEP}ות${B}`, 'אנשי', 'נשות'], // אנשי/ות
  [`מישהו${SEP}י${B}`, 'מישהו', 'מישהי'], // מישהו/י
  [`אחד${SEP}(אח)?ת${B}`, 'אחד', 'אחת'], // אחד/ת, אחד/אחת
  [`אחת${SEP}(אח)?ד${B}`, 'אחד', 'אחת'], // אחת/ד, אחת/אחד
  [`יזמים${SEP}י?ות${B}`, 'יזמים', 'יזמיות'], // יזמים/ות, יזמים/יות
  [`מומחים${SEP}י?ות${B}`, 'מומחים', 'מומחיות'], // מומחים/ות, מומחים/יות
  [`מכונאים${SEP}י?ות${B}`, 'מכונאים', 'מכונאיות'], // מכונאים/ות, מומחים/יות
  [`ישראלים${SEP}י?ות${B}`, 'ישראלים', 'ישראליות'], // ישראלים/ות, ישראלים/יות
  [`יהודים${SEP}י?ות${B}`, 'יהודים', 'יהודיות'], // יהודים/ות, יהודים/יות
  [`ערבים${SEP}י?ות${B}`, 'ערבים', 'ערביות'], // ערבים/ות, ערבים/יות
  [`אשכנזים${SEP}י?ות${B}`, 'אשכנזים', 'אשכנזיות'], // אשכנזים/ות, אשכנזים/יות
  [`מזרחים${SEP}י?ות${B}`, 'מזרחים', 'מזרחיות'], // מזרחים/ות, מזרחים/יות
  [`ספרדים${SEP}י?ות${B}`, 'ספרדים', 'ספרדיות'], // ספרדים/ות, ספרדים/יות
  [`סלאבים${SEP}י?ות${B}`, 'סלאבים', 'סלאביות'], // סלאבים/ות, סלאבים/יות
  [`צרפתים${SEP}י?ות${B}`, 'צרפתים', 'צרפתיות'], // צרפתים/ות, צרפתים/יות
  [`ברבא?רים${SEP}י?ות${B}`, 'ברבא?רים', 'ברבא?ריות'], // ברבא?רים/ות, ברבא?רים/יות

  // Beginnings
  [`(${B})(${HEB}{0,3})י${SEP}ת(${HEB}{2,})`, '$1$2י$3', '$1$2ת$3'], // שי/תכתוב
  [`(${B})(${HEB}{0,3})ת${SEP}י(${HEB}{2,})`, '$1$2י$3', '$1$2ת$3'], // שת/יכתוב
  // Endings
  [`ו${SEP}ה${B}`, 'ו', 'ה'], // בגללה/ו
  [`ה${SEP}ו${B}`, 'ו', 'ה'], // בגללו/ה
  [`(${HEB})${SEP}ה${B}`, '$1', '$1ה'], // בגללו/ה
  [`(${HEB})ה${SEP}תה${B}`, '$1ה', '$1תה'], // בכה/תה
  [`(${HEB})י${SEP}תי${B}`, '$1י', '$1תי'], // יקירי/תי
  [`(${HEB})יו${SEP}י?ה${B}`, '$1יו', '$1יה'], // מחקריו/יה
  [`(${HEB})ה${SEP}ית${B}`, '$1ה', '$1ית'], // מומחה/ית
  [`(${HEB})י${SEP}ות${B}`, '$1י', '$1ות'], // מומחי/ות
  [`(${HEB})ות${SEP}י${B}`, '$1י', '$1ות'], // מומחות/י
  [`(${HEB})${SEP}ית${B}`, '$1', '$1ית'], // סטודנט/ית

  [`(${HEB}{4,})טים${SEP}י?ות${B}`, '$1טים', '$1טיות'], // סטודנטים/ות
  [`(${HEB}{4,})אים${SEP}י?ות${B}`, '$1אים', '$1איות'], // ארגנטינאים/ות
  [`יים${SEP}(י)?ות${B}`, 'יים', 'יות'], // ערביים/ות
  [`(י)?ים${SEP}?(י)?ות${B}`, '$1ים', '$1$2ות'], // מורים/ות
  [`(י)?ות${SEP}?י?ים${B}`, '$1ים', '$1ות'], // מורות/ים

  [`י${SEP}ות${B}`, 'י', 'ות'], // עורכי/ות
  [`(${HEB})ו(${HEB})${SEP}י${B}`, '$1ו$2', '$1$2י'], // עורכי/ות

  [`(${HEB})ה${SEP}י${B}`, '$1ה', '$1י'], // ראה/י
  [`(${FIN})${SEP}י${B}`, '$1', 'י$1י'], //  השען/י
  [`(${HEB})${SEP}י${B}`, '$1', 'י$1י'], // הקשב/י
  [`(${HEB})(ה)?${SEP}ת${B}`, '$1$2', '$1ת'], // נהג/ת, רואה/ת חשבון
  [`(${HEB})ם${SEP}?ן${B}`, '$1ם', '$1ן'], // אתם/ן
  [`(${HEB})ן${SEP}?ם${B}`, '$1ם', '$1ן'], // אתן/ם
  [`(${HEB}+)ו${SEP}ת(${HEB}+)נה`, '$1ו', 'ת$2נה'], // צאו/תצאנה
  [`(${HEB})${SEP}נה${B}`, '$1', '$1נה'], // צאו/נה

  // Parentheses
  [`(${HEB}+)\\(([ותי]{1,3})\\)([יוהםן]{1,3})${B}`, '$1$3', '$1$2$3'], // מתנגד(ות)יו, מתנגד(ות)יהם
  [`(${HEB}+)י\\(י\\)(${HEB}*)(${FIN})${B}`, '$1י$2$3', '$1יי$2$3'], // פני(י)ך
  [`(${HEB}+)\\(י\\)י(${HEB}*)(${FIN})${B}`, '$1י$2$3', '$1יי$2$3'], // פנ(י)יך
  [`\\(א\\)נשים${B}`, 'אנשים', 'נשים'], // (א)נשים
  [`(${HEB}+)ב\\(ת\\)${B}`, '$1ב', '$1בת'], // חושב(ת)

  // Final Letters fixes
  [`ץ(?=${HEB})`, 'צ', 'צ'], // חרוץה
  [`ך(?=${HEB})`, 'כ', 'כ'], // משךי
  [`ן(?=${HEB})`, 'נ', 'נ'], // השעןי
  [`ם(?=${HEB})`, 'מ', 'מ'], // יזםית
  [`ף(?=${HEB})`, 'פ', 'פ'], // פילוסוףית

  [`צ${B}`, 'ץ', 'ץ'], // חרוצ
  [`כ${B}`, 'ך', 'ך'], // משוכ
  [`נ${B}`, 'ן', 'ן'], // השענ
  [`מ${B}`, 'ם', 'ם'], // יזמ
  [`פ${B}`, 'ף', 'ף'], // פילוסופ

  // Special Syntax
  ['\\[([^|]+?)\\|([^|]+?)\\|([^|]+?)\\]', '$1', '$2', '$3'], // [בן|בת|ילד]
  ['\\[([^|]+?)\\|([^|]+?)\\]', '$1', '$2'], // [בן|בת]
].map((p) => {
  p[0] = new RegExp(p[0], 'g');
  return p;
});
