const SEP = '[/.]';
const EXTSEP = '[./—־-]';
const HEB = '[א-ת]';
const FIN = '[ןףךםץ]';
const B = '(?=^|$|\b|[^א-ת?])'; // Boundary, like "\b" in regex

export default [
  // Whole Words
  [`רו(ץ|צ)${SEP}י${B}`, 'רוץ', 'רוצי'], // רוצ/י
  [`קו(ם|מ)${SEP}י${B}`, 'קום', 'קומי'], // קומ/י
  [`עו(ף|פ)${SEP}י${B}`, 'עוף', 'עופי'], // עופ/י
  [`שי(ם|מ)${SEP}י${B}`, 'שים', 'שימי'], // שים/י
  [`אח${SEP}ות${B}`, 'אח', 'אחות'], // אח/ות
  [`ל(ו|ה)${SEP}ל(ו|ה)${B}`, 'לו', 'לה'], // לו/לה, לה/לו
  [`ה(ו|י)א${SEP}ה(ו|י)א${B}`, 'הוא', 'היא'], // הוא/היא, היא/הוא
  [`אנשי${SEP}ות${B}`, 'אנשי', 'נשות'], // אנשי/ות
  [`מישהו${SEP}י${B}`, 'מישהו', 'מישהי'], // מישהו/י
  [`אחד${SEP}(אח)?ת${B}`, 'אחד', 'אחת'], // אחד/ת, אחד/אחת

  // Endings
  [`ו${SEP}ה${B}`, 'ו', 'ה'], // בגללה/ו
  [`ה${SEP}ו${B}`, 'ו', 'ה'], // בגללו/ה
  [`(${HEB})${SEP}ה${B}`, '$1', '$1ה'], // בגללו/ה
  [`(${HEB})ה${SEP}ית${B}`, '$1ה', '$1ית'], // מומחה/ית
  [`(${HEB})${SEP}ית${B}`, '$1', '$1ית'], // סטודנט/ית
  [`יות${SEP}ים${B}`, 'ים', 'יות'], // ישראליות/ים
  [`(י)?ים${SEP}?(י)?ות${B}`, '$1$2ים', '$1ות'], // ישראלי/ות
  [`י${SEP}ות${B}`, 'י', 'ות'], // עורכי/ות
  [`(${HEB})ו(${HEB})${SEP}י${B}`, '$1ו$2', '$1$2י'], // עורכי/ות
  [`(${FIN})${SEP}י${B}`, '$1', '$1י'], //  השען/י
  [`(${HEB})ה${SEP}י${B}`, '$1ה', '$1י'], // ראה/י
  [`(${HEB})ה?${SEP}ת${B}`, '$1', '$1ת'], // נהג/ת
  [`(${HEB})ם${SEP}?ן${B}`, '$1ם', '$1ן'], // אתם/ן

  // Beginnings
  [`א${EXTSEP}נשים`, 'אנשים', 'נשים'], // א.נשים
  [`א${EXTSEP}נשי(?!ם)`, 'אנשי', 'נשות'], // א.נשי

  // Final Letters fixes
  [`ץ(?=${HEB})`, 'צ', 'צ'], // חרוץה
  [`ך(?=${HEB})`, 'כ', 'כ'], // משךי
  [`ן(?=${HEB})`, 'נ', 'נ'], // השעןי
  [`ם(?=${HEB})`, 'מ', 'מ'], // יזםית
].map((p) => [new RegExp(p[0], 'g'), p[1], p[2]]);
